# Data Wrangling -  Join and Merge

## Concat, append

In [1]:
import pandas as pd

In [82]:
df1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

df2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [6]:
#join along row
pd.concat([df1, df2], axis=0)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [7]:
#join along columns 
pd.concat([df1,df2], axis =1)

  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton    200         S4  Scarlette Fisher    201
1         S2      Ryder Storey    210         S5  Carla Williamson    200
2         S3      Bryce Jensen    190         S6       Dante Morse    198
3         S4         Ed Bernal    222         S7    Kaiser William    219
4         S5       Kwame Morin    199         S8   Madeeha Preston    201

In [17]:
#append a row to the dataframe df1
x = pd.Series(['S6', 'Smith', '210'], index=['student_id', 'name', 'marks'])
print(x)

df1.append(x, ignore_index=True)

student_id       S6
name          Smith
marks           210
dtype: object

  student_id              name marks
0         S1  Danniella Fenton   200
1         S2      Ryder Storey   210
2         S3      Bryce Jensen   190
3         S4         Ed Bernal   222
4         S5       Kwame Morin   199
5         S6             Smith   210

In [18]:
#append a dict 
dic = [{'student_id':'S7', 'name':'Giorgia', 'marks':200},
       {'student_id':'S8', 'name':'Hola', 'marks':220}]
df1.append(dic)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S7           Giorgia    200
1         S8              Hola    220

In [70]:
#shuffle a df, then join to on rows and the 3rd one on column (but join with the key student id)
df3 = exam_data = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})
df3.head()

## Let's shuffle df3
#using numpy
'''
import numpy as np
x = np.repeat(np.arange(6), 10).reshape(6, -1)
np.random.shuffle(x)
x
'''

df3 = df3.sample(frac=1) #frac is the fraction of rows you return 
print(df3)
tmp = pd.concat([df1, df2], axis=0)
print('tmp', tmp.head())

   student_id  exam_id
11        S13       12
8         S10       56
2          S3       12
4          S5       21
3          S4       67
10        S12       88
0          S1       23
9         S11       83
7          S9       14
1          S2       45
5          S7       55
6          S8       33
tmp   student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

## Merge

In [ ]:
# Let's merge [df1,df2] and df3 along the key student id
##There are 2 difficulties: don't have the same # of rows
##                          rows aren't in the same order
#pd.concat([tmp, df3], join='inner', axis=1) #gives us 2 times the column student id
pd.merge(tmp, df3, how='left', on = 'student_id')

In [84]:
#merge df1 and df2 looking for common rows
pd.merge(df1, df2, how='inner', on='student_id')

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

In [90]:
#merge left on key1 and key2
df1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
df2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})
print(df1, '\n \n', df2)

  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3

   key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

In [93]:
pd.merge(df1, df2, how = 'left', on = ['key1', 'key2'])

  key1 key2   P   Q    R    S
0   K0   K0  P0  Q0   R0   S0
1   K0   K1  P1  Q1  NaN  NaN
2   K1   K0  P2  Q2   R1   S1
3   K1   K0  P2  Q2   R2   S2
4   K2   K1  P3  Q3  NaN  NaN

In [96]:
#Write a Pandas program to create a new DataFrame based on existing series, 
#using specified argument and override the existing columns names
s1 = pd.Series([1,2,3], name ='foo')
s2 = pd.Series([3,5,1])
s3 = pd.Series([3,5,1])

pd.concat([s1, s2, s3], axis=1,  keys=['A', 'B', 'C'])

   A  B  C
0  1  3  3
1  2  5  5
2  3  1  1

In [100]:
#Write a Pandas program to combine the columns of 
#two potentially differently-indexed DataFrames into a single result DataFrame.
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])

df2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

print(df1, '\n \n',  df2)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

      C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [106]:
#first manner if we care about the indexes
print(pd.concat([df1, df2], axis=1))

print('\n')
#if we don't care about the indexes
print(pd.concat([df1,df2], axis=0, ignore_index=True))

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3


     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   C0   D0
4  NaN  NaN   C2   D2
5  NaN  NaN   C3   D3

## Combine

In [108]:
#Write a Pandas program to Combine two DataFrame objects by filling null values 
#in one DataFrame with non-null values from other DataFrame
df1 = pd.DataFrame({'A': [None, 0, None], 'B': [3, 4, 5]})
df2 = pd.DataFrame({'A': [1, 1, 3], 'B': [3, None, 3]})

print(df1, '\n \n', df2)

     A  B
0  NaN  3
1  0.0  4
2  NaN  5

    A    B
0  1  3.0
1  1  NaN
2  3  3.0

In [110]:
df1.combine_first(df2)

     A  B
0  1.0  3
1  0.0  4
2  3.0  5